numbers = [1, 2, 3, 4]


def input_list(numb):
    numb[1] = 100
    return numb


result = input_list(numbers)
print(result)
print(f'изменения в нутри функции без копий {numbers}')
# копия a.copy()
a = [1, 2, 3, 4, 34]
b = a.copy()
b[1] = 300
print(f'--> копия a.copy() {a}')
# копия срезом:
a = [1, 2, 3, 4, 34]
b = a[:]
b[1] = 300
print(f'----> срезом {a}')

# не работают если есть вложенный списки
# копия срезом:
a = [1, 2, 23, [4, 34, 9]]
b = a[:]
b[3][0] = 300
print(f'----> срезом + влож список {a}')
print(f'----> срезом  + влож список {b} ')
# не работают если есть вложенный списки
# копия a.copy()
a = [1, 2, [4, 34]]
b = a.copy()
b[2][1] = 300
print(f'----> копия a.copy()  + влож список {a} ')
print(f'----> копия a.copy()   + влож список {b} ')
